Given a sample list, tuple and a set with elements as numbers from 1-10. Convert each
of the data types into a pandas series. Create a separate list of index values for the
series.

In [1]:
import pandas as pd

In [2]:
l = list(range(1,11))

In [3]:
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [4]:
t = tuple(range(1,11))

In [5]:
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [22]:
s = set(range(1,11))

In [23]:
s

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [24]:
s = list(s)

In [25]:
s

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [8]:
series1 = pd.Series(l)

In [9]:
series1

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [10]:
series2 = pd.Series(t)

In [11]:
series2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [27]:
series3 = pd.Series(s)
series3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [13]:
#set --> It is an unordered data type

In [14]:
! pip install ordered-set

Requirement already satisfied: ordered-set in c:\users\lenovo\anaconda3\lib\site-packages (4.1.0)

In [16]:
from ordered_set import OrderedSet

In [19]:
s = OrderedSet(range(1,11))
s

OrderedSet([1, 2, 3, 4, 5, 6, 7, 8, 9, 10])

In [20]:
series3 = pd.Series(s)

In [21]:
series3

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [29]:
pd.Series(s, index=['a','b','c','d','e','f','g','h','i','j'])

a     1
b     2
c     3
d     4
e     5
f     6
g     7
h     8
i     9
j    10
dtype: int64

In [30]:
series1.index=['k','l','m','n','o','p','q','r','s','t']

In [31]:
series1

k     1
l     2
m     3
n     4
o     5
p     6
q     7
r     8
s     9
t    10
dtype: int64

In [ ]:
# Dictionary --> key-value pairs,   key -- user-defined index value,  value-- the element/value that you want to store

2. Create a python dictionary with three key value pairs. Keep the keys as the first names,
and the respective last names as values in the dictionary. Use the dictionary to create a
pandas series.

In [32]:
a = {'Sachin':'Tendulkar', 'MS':'Dhoni', 'Virat':'Kohli'}

In [33]:
a

{'Sachin': 'Tendulkar', 'MS': 'Dhoni', 'Virat': 'Kohli'}

In [34]:
s1 = pd.Series(a)

In [35]:
s1

Sachin    Tendulkar
MS            Dhoni
Virat         Kohli
dtype: object

3. Create a pandas series, with the elements as numbers from 1-10. Use the index values
starting from 0-10. For the above series:

a. Convert it to a list.

b. Convert it to a dictionary.

c. Convert it to a tuple.

d. Convert it to a set.

In [36]:
sr = pd.Series(range(1,11))
sr

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [37]:
#a.
l = list(sr)

In [38]:
l

[1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

In [39]:
#b.
d = dict(sr)

In [40]:
d

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

In [41]:
#c.
t = tuple(sr)

In [42]:
t

(1, 2, 3, 4, 5, 6, 7, 8, 9, 10)

In [43]:
#d.
s5 = set(sr)

In [44]:
s5

{1, 2, 3, 4, 5, 6, 7, 8, 9, 10}

In [46]:
d1=dict(sr)
print(d)
type(d)

{0: 1, 1: 2, 2: 3, 3: 4, 4: 5, 5: 6, 6: 7, 7: 8, 8: 9, 9: 10}

dict

4. Create a sample pandas series with x integer elements. Perform the following operations
on the same:

a. Print the first 5 elements of the series

b. Print the last 5 elements of the series

c. Insert an integer value ‘50’ at the index 5.

d. Update the last element in the series with the value 100.

e. Delete the first element from the series.

Note: The index values must not be affected by the operations and should be uniform for
the series after the last operation.

In [92]:
se = pd.Series(range(1,11))
se

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [50]:
#a.
se.head()   #head()---> first five elements present in your data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [51]:
#b.
se.tail()   #tail()---> last five elements

5     6
6     7
7     8
8     9
9    10
dtype: int64

In [52]:
se[5] = 50

In [53]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [59]:
se.add(50)

0    51
1    52
2    53
3    54
4    55
5    56
6    57
7    58
8    59
9    60
dtype: int64

In [61]:
se.iloc[5] = 50

In [62]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [88]:
se.update(pd.Series([50], index=[5]))

In [89]:
se

0     1
1     2
2     3
3     4
4     5
5    50
6     7
7     8
8     9
9    10
dtype: int64

In [90]:
se[9] = 100

In [91]:
se

0      1
1      2
2      3
3      4
4      5
5     50
6      7
7      8
8      9
9    100
dtype: int64

In [93]:
se

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

In [97]:
se[9] = 100

In [98]:
se

0      1
1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9    100
dtype: int64

In [99]:
#e.
se = se.drop(0)

In [103]:
se

1      2
2      3
3      4
4      5
5      6
6      7
7      8
8      9
9    100
dtype: int64

In [110]:
se = se.reset_index(drop=True)

In [111]:
se

0      2
1      3
2      4
3      5
4      6
5      7
6      8
7      9
8    100
dtype: int64

In [ ]:
se

5. For a given pandas series obtained in the 4th step. Write a sample code to find the
element 100 in the series.

In [112]:
se

0      2
1      3
2      4
3      5
4      6
5      7
6      8
7      9
8    100
dtype: int64

In [118]:
for i in se:
    if i==100:
        print('100 is present')

100 is present

In [122]:
x = se[se==100]   # Checking the index value of element 100

In [123]:
x

8    100
dtype: int64

In [125]:
se[8]

100

6. For the given series A and B, perform concatenation on the same.

series_A = pd.Series([1,2,3,4,5])

series_B = pd.Series([6,7,8,9,10])

In [1]:
import pandas as pd

In [2]:
series_A = pd.Series([1,2,3,4,5])
series_B = pd.Series([6,7,8,9,10])

In [3]:
c = pd.concat([series_A,series_B])

In [4]:
c

0     1
1     2
2     3
3     4
4     5
0     6
1     7
2     8
3     9
4    10
dtype: int64

In [5]:
c = c.reset_index(drop=True)

In [6]:
c

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

7. Using loops in python, print all the elements within a pandas series.

Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])

In [8]:
Sample = pd.Series([1,2,3,4,5,6,7,8,9,10])
for i in Sample:
    print(i)

1
2
3
4
5
6
7
8
9
10

8. For a given nested list and a sample dictionary, create two data frames using pandas.

List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [9]:
List = [['AA','BB','CC'], ['DD','EE','FF'], ['GG','HH','II']]

In [10]:
df = pd.DataFrame(List)

In [11]:
df

    0   1   2
0  AA  BB  CC
1  DD  EE  FF
2  GG  HH  II

In [12]:
Dictionary = { 'Kris': ['Jordan', 12,22],'Memphis': ['Depay', 23, 24]}

In [13]:
df1 = pd.DataFrame(Dictionary)

In [14]:
df1

     Kris Memphis
0  Jordan   Depay
1      12      23
2      22      24

9. Create a pandas Dataframe with two columns = [‘Name’, ‘Age’]. Perform the following
operations on the same.

a. Print the first 3 rows of the Data Frame .

b. Print the rows that have the age greater than 15.

c. Insert 5 imaginary names and ages as values to the pandas Data Frame .

d. Update the 5th row so that the name = john and age=56.

e. Delete the first row from the Data Frame .

In [16]:
data = [['a',19],['b',18],['c',21],['d',15],['e',12]]

In [19]:
df2 = pd.DataFrame(data, columns = ['name','age'])

In [24]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12

In [21]:
df2.head(3)

  name  age
0    a   19
1    b   18
2    c   21

In [22]:
df2[df2.age>15]

  name  age
0    a   19
1    b   18
2    c   21

In [28]:
df2.loc[5]=['f',20]

In [29]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12
5    f   20

In [30]:
df2.loc[6] = ['g', 18]
df2.loc[7] = ['h', 12]
df2.loc[8] = ['i', 25]
df2.loc[9] = ['j', 22]

In [31]:
df2

  name  age
0    a   19
1    b   18
2    c   21
3    d   15
4    e   12
5    f   20
6    g   18
7    h   12
8    i   25
9    j   22

In [32]:
df2.loc[4] = ['john', 56]

In [33]:
df2

   name  age
0     a   19
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [35]:
df2 = df2.drop(0)

In [36]:
df2

   name  age
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [37]:
df2.reset_index(drop = True)

   name  age
0     b   18
1     c   21
2     d   15
3  john   56
4     f   20
5     g   18
6     h   12
7     i   25
8     j   22

10. For the Data Frame obtained from step 9, convert the same to a list and a dictionary
respectively.

In [38]:
df2

   name  age
1     b   18
2     c   21
3     d   15
4  john   56
5     f   20
6     g   18
7     h   12
8     i   25
9     j   22

In [41]:
df2.values.tolist()

[['b', 18],
 ['c', 21],
 ['d', 15],
 ['john', 56],
 ['f', 20],
 ['g', 18],
 ['h', 12],
 ['i', 25],
 ['j', 22]]

In [42]:
dict(df2.values)

{'b': 18,
 'c': 21,
 'd': 15,
 'john': 56,
 'f': 20,
 'g': 18,
 'h': 12,
 'i': 25,
 'j': 22}

11. Create two separate Data Frame s A and B, and perform the following operations on
them.

a. Concatenate the two Data Frame s to a new Data Frame C.

b. Split the Data Frame C row wise.

c. Split the Data Frame column wise based on a condition. For example - columns
values greater than 10, column values less than 10, etc.

In [45]:
A = pd.DataFrame(range(1,21), columns = ['A'])

In [46]:
A

     A
0    1
1    2
2    3
3    4
4    5
5    6
6    7
7    8
8    9
9   10
10  11
11  12
12  13
13  14
14  15
15  16
16  17
17  18
18  19
19  20

In [49]:
B = pd.DataFrame(range(20,0,-1), columns = ['B'])

In [50]:
B

     B
0   20
1   19
2   18
3   17
4   16
5   15
6   14
7   13
8   12
9   11
10  10
11   9
12   8
13   7
14   6
15   5
16   4
17   3
18   2
19   1

In [59]:
C = pd.concat([A,B], axis = 1)  #axis = 0-> rows, axis = 1 -> columns

In [58]:
C

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [70]:
split_c = C.iloc[0:10]

In [71]:
split_c

    A   B
0   1  20
1   2  19
2   3  18
3   4  17
4   5  16
5   6  15
6   7  14
7   8  13
8   9  12
9  10  11

In [68]:
split_d = C.iloc[10:]   # [RowStartingIndexVAlue:RowEndingIndexVAlue+1, ColumnStartingIndexValue:ColumnEndingIndexValue+1]
                        #[:,:]

In [69]:
split_d

     A   B
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [77]:
greater_10 = C['B']>10
g = C['A']>10

In [95]:
greater_10
d = C[greater_10]
e = C[g]

In [94]:
d

    A   B
0   1  20
1   2  19
2   3  18
3   4  17
4   5  16
5   6  15
6   7  14
7   8  13
8   9  12
9  10  11

In [96]:
e

     A   B
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [97]:
pd.concat([d,e])

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1

In [108]:
Q = C[(C['A']>10) | (C['B']>10)]

In [109]:
Q

     A   B
0    1  20
1    2  19
2    3  18
3    4  17
4    5  16
5    6  15
6    7  14
7    8  13
8    9  12
9   10  11
10  11  10
11  12   9
12  13   8
13  14   7
14  15   6
15  16   5
16  17   4
17  18   3
18  19   2
19  20   1